In [17]:
# імпортуємо все що нам потрібно для роботи
import _sqlite3
import pandas as pd

connection = _sqlite3.connect('hw.db');

In [18]:
cursor = connection.cursor()

# створимо метод який буде екзекьютити наші запити
def execute_query(cursor_, connection_, query):
    try:
        cursor_.executescript(query)
        connection_.commit()
    except Exception as e:
        print(e)
        connection_.rollback()

In [19]:
#Створимо таблиці довільними методами. Я вирішив назвати таблиці більш інтуїтивно vehicles, drivers, roads. Та зробити невелику нормалізацію, у нас в кожній таблиці зустрічається атрибут категорія, тому я вирішив винести цей атриубут в окрему таблицю та просто в кожну з таблиць подобавляти зовінішні клоючі

create_all_tables_sql_query = '''
create table categories
(
    id            bigserial
        primary key,
    category_name varchar(255)
);

create table vehicles
(
    id                  bigserial
        primary key,
    vehicle_type        varchar(255),
    milleage            double precision,
    max_speed           double precision,
    passenger_count     integer,
    vehicle_category_id bigint
        constraint fk_vehicle_category_constraint
            references categories
);

create table drivers
(
    id                 bigserial
        primary key,
    driver_name        varchar(255),
    driver_category_id bigint
        constraint fk_driver_category_constraint
            references categories,
    vehicle_id         bigint
        constraint fk_vehicle_constraint
            references vehicles
);

create table roads
(
    id               bigserial
        primary key,
    permitted_road   varchar(255),
    road_category_id bigint
        constraint fk_road_category_constraint
            references categories
);'''

execute_query(cursor, connection, create_all_tables_sql_query)

In [20]:
#Заповнимо наші таблиці за умовою задачі

fill_tables_sql_query = '''
insert into categories (id, category_name) values (1, 'A');
insert into categories (id, category_name) values (2, 'B');
insert into categories (id, category_name) values (3, 'C');

insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (1, 'Мотоцикл-Аврора', 10000, 120, 2, 1);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (2, 'Мопед', 5000, 90, 1, 1);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (3, 'Скутер', 500, 70, 2, 1);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (4, 'Авто седан Тойота', 100000, 170, 5, 2);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (5, 'Авто купе БМВ', 300000, 220, 5, 2);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (6, 'Авто Мазда 6 седан', 138600, 240, 5, 2);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (7, 'Авто БМВ X7 джип', 200000, 300, 7, 2);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (8, 'Авто Хюндай Соната купе', 30000, 90, 5, 2);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (9, 'Авто смарт', 100000, 175, 2, 2);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (10, 'Авто Ролс Ройс', 100, 280, 5, 2);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (11, 'Авто Тойота Приус хетчбек', 10000, 200, 5, 2);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (12, 'Авто Форд фокус седан', 600000, 190, 5, 2);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (13, 'Авто Митсубищи Лансер 10 седан', 50000, 140, 5, 2);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (14, 'Авто джили хетчбек', 400000, 168, 5, 2);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (15, 'Авто Хонда Акорд седан', 1000000, 193, 5, 2);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (16, 'Вантажівка ISUZU', 1000000, 120, 3, 3);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (17, 'Мікроавтобус Ford Transit', 130000, 150, 8, 3);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (18, 'Мікроавтобус VW T4', 120000, 180, 8, 3);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (19, 'Автобус Mercedess Sprinter', 190000, 170, 24, 3);
insert into vehicles (id, vehicle_type, milleage, max_speed, passenger_count, vehicle_category_id) values (20, 'Автобус ISUZU ', 200000, 120, 30, 3);

insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (3, 'Андрій', 1, 3);
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (1, 'Василь', 1, 4); --Помилковий запис. Водій з категорією А водить транспорт категорії B
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (2, 'Ілля', 1, 5); --Помилковий запис. Водій з категорією А водить транспорт категорії B
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (8, 'Вадим', 2, 8);
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (9, 'Анастасія', 2, 9);
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (10, 'Вячеслав', 2, 10);
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (11, 'Оксамит', 2, 11);
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (12, 'Іван', 2, 12);
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (13, 'Володимир', 2, 13);
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (14, 'Олександр', 2, 14);
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (15, 'Олексій', 2, 15);
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (6, 'Сергій', 2, 6);
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (7, 'Влад', 2, 7);
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (5, 'Петро', 2, 2); --Помилковий запис. Водій з категорією B водить транспорт категорії A
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (4, 'Аліна', 2, 1); --Помилковий запис. Водій з категорією B водить транспорт категорії A
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (16, 'Гаврил', 3, 8); --Помилковий запис. Водій з категорією C водить транспорт категорії B
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (19, 'Дмитро', 3, 19);
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (17, 'Інна', 3, 9); --Помилковий запис. Водій з категорією C водить транспорт категорії B
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (20, 'Юлія', 3, 20);
insert into drivers (id, driver_name, driver_category_id, vehicle_id) values (18, 'Оксана', 3, 10); --Помилковий запис. Водій з категорією C водить транспорт категорії B

insert into roads (id, permitted_road, road_category_id) values (1, 'М-30', 1);
insert into roads (id, permitted_road, road_category_id) values (2, 'Р-60', 2);
insert into roads (id, permitted_road, road_category_id) values (3, 'РО-29', 2);
insert into roads (id, permitted_road, road_category_id) values (4, 'YI-09', 1);
insert into roads (id, permitted_road, road_category_id) values (5, 'TR-32', 2);
insert into roads (id, permitted_road, road_category_id) values (6, 'HLM-17', 2);
insert into roads (id, permitted_road, road_category_id) values (7, 'NV-34', 1);
insert into roads (id, permitted_road, road_category_id) values (8, 'FA-86', 1);
insert into roads (id, permitted_road, road_category_id) values (9, 'JNB-546', 3);
insert into roads (id, permitted_road, road_category_id) values (10, 'DJZW-8718', 3);

'''

execute_query(cursor, connection, fill_tables_sql_query)

In [21]:
successfully_driver_vehicle_matching_df = pd.read_sql_query(
    '''select d.id             as driver_id,
       v.id             as vehicle_id,
       d.driver_name,
       v.vehicle_type,
       c.category_name  as vehicle_category,
       c2.category_name as driver_category
from drivers d
         LEFT JOIN vehicles v on v.id = d.vehicle_id
         LEFT JOIN categories c on c.id = v.vehicle_category_id
         LEFT JOIN categories c2 on c2.id = d.driver_category_id
                   
where d.driver_category_id = v.vehicle_category_id''',
    connection)
successfully_driver_vehicle_matching_df

,driver_id,vehicle_id,driver_name,vehicle_type,vehicle_category,driver_category
0,3,3,Андрій,Скутер,A,A
1,8,8,Вадим,Авто Хюндай Соната купе,B,B
2,9,9,Анастасія,Авто смарт,B,B
3,10,10,Вячеслав,Авто Ролс Ройс,B,B
4,11,11,Оксамит,Авто Тойота Приус хетчбек,B,B
5,12,12,Іван,Авто Форд фокус седан,B,B
6,13,13,Володимир,Авто Митсубищи Лансер 10 седан,B,B
7,14,14,Олександр,Авто джили хетчбек,B,B
8,15,15,Олексій,Авто Хонда Акорд седан,B,B
9,6,6,Сергій,Авто Мазда 6 седан,B,B
10,7,7,Влад,Авто БМВ X7 джип,B,B
11,19,19,Дмитро,Автобус Mercedess Sprinter,C,C
12,20,20,Юлія,Автобус ISUZU,C,C

In [22]:
successfully_driver_vehicle_matching_df.to_excel('success_driver_matching.xlsx')

In [24]:
two_types_road_drivers = pd.read_sql_query(
    '''SELECT d.*
FROM drivers d
LEFT JOIN vehicles v ON v.id = d.vehicle_id
LEFT JOIN categories c1 ON c1.id = v.vehicle_category_id
LEFT JOIN categories c2 ON c2.id = d.driver_category_id
WHERE d.driver_category_id = v.vehicle_category_id
  AND d.driver_category_id IN (
    SELECT r.road_category_id
    FROM roads r
    GROUP BY r.road_category_id
    HAVING COUNT(*) = 2
  );''',
    connection)
two_types_road_drivers

   id driver_name  driver_category_id  vehicle_id
0  19      Дмитро                   3          19
1  20        Юлія                   3          20

In [25]:
two_types_road_drivers.to_excel('two_types_road_drivers.xlsx')

In [27]:
speed_average_by_category = pd.read_sql_query('''
select c.category_name, avg(v.max_speed)
from vehicles v
         left outer join categories c on c.id = v.vehicle_category_id
group by v.vehicle_category_id, category_name
ORDER BY category_name
''', connection)
speed_average_by_category

  category_name  avg(v.max_speed)
0             A         93.333333
1             B        197.166667
2             C        148.000000

In [28]:
max_milleage_by_category = pd.read_sql_query('''
select c.category_name, max(v.milleage)
from vehicles v
         left outer join categories c on c.id = v.vehicle_category_id
group by v.vehicle_category_id, category_name
ORDER BY category_name
''', connection)
max_milleage_by_category

  category_name  max(v.milleage)
0             A          10000.0
1             B        1000000.0
2             C        1000000.0

In [29]:
max_speed_by_passenger_quantity = pd.read_sql_query('''
select max(v.max_speed)
from vehicles v
         left outer join categories c on c.id = v.vehicle_category_id where v.passenger_count > 8
''', connection)
max_speed_by_passenger_quantity

   max(v.max_speed)
0             170.0